{
    "format": "layers-model",
    "generatedBy": "keras v2.3.1",
    "convertedBy": "TensorFlow.js Converter v2.0.0",
    "modelTopology": {
        "keras_version": "2.3.1",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Model",
            "config": {
                "name": "model_1",
                "layers": [
                    {
                        "name": "input_1",
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                256,
                                256,
                                3
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "name": "input_1"
                        },
                        "inbound_nodes": []
                    },
                    {
                        "name": "zero_padding2d_1",
                        "class_name": "ZeroPadding2D",
                        "config": {
                            "name": "zero_padding2d_1",
                            "trainable": true,
                            "dtype": "float32",
                            "padding": [
                                [
                                    0,
                                    1
                                ],
                                [
                                    0,
                                    1
                                ]
                            ],
                            "data_format": "channels_last"
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "conv2d_1",
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_1",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 32,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 1.0,
                                    "mode": "fan_avg",
                                    "distribution": "uniform",
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "zero_padding2d_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "batch_normalization_1",
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_1",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "re_lu_1",
                        "class_name": "ReLU",
                        "config": {
                            "name": "re_lu_1",
                            "trainable": true,
                            "dtype": "float32",
                            "max_value": null,
                            "negative_slope": 0.0,
                            "threshold": 0.0
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "depthwise_conv2d_1",
                        "class_name": "DepthwiseConv2D",
                        "config": {
                            "name": "depthwise_conv2d_1",
                            "trainable": true,
                            "dtype": "float32",
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "activation": "linear",
                            "use_bias": true,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "depth_multiplier": 1,
                            "depthwise_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 1.0,
                                    "mode": "fan_avg",
                                    "distribution": "uniform",
                                    "seed": null
                                }
                            },
                            "depthwise_regularizer": null,
                            "depthwise_constraint": null
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "re_lu_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "batch_normalization_2",
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_2",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "depthwise_conv2d_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "re_lu_2",
                        "class_name": "ReLU",
                        "config": {
                            "name": "re_lu_2",
                            "trainable": true,
                            "dtype": "float32",
                            "max_value": null,
                            "negative_slope": 0.0,
                            "threshold": 0.0
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "conv2d_2",
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_2",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                1,
                                1
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 1.0,
                                    "mode": "fan_avg",
                                    "distribution": "uniform",
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "re_lu_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "batch_normalization_3",
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_3",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "re_lu_3",
                        "class_name": "ReLU",
                        "config": {
                            "name": "re_lu_3",
                            "trainable": true,
                            "dtype": "float32",
                            "max_value": null,
                            "negative_slope": 0.0,
                            "threshold": 0.0
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_3",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "zero_padding2d_2",
                        "class_name": "ZeroPadding2D",
                        "config": {
                            "name": "zero_padding2d_2",
                            "trainable": true,
                            "dtype": "float32",
                            "padding": [
                                [
                                    0,
                                    1
                                ],
                                [
                                    0,
                                    1
                                ]
                            ],
                            "data_format": "channels_last"
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "re_lu_3",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "depthwise_conv2d_2",
                        "class_name": "DepthwiseConv2D",
                        "config": {
                            "name": "depthwise_conv2d_2",
                            "trainable": true,
                            "dtype": "float32",
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "activation": "linear",
                            "use_bias": true,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "depth_multiplier": 1,
                            "depthwise_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 1.0,
                                    "mode": "fan_avg",
                                    "distribution": "uniform",
                                    "seed": null
                                }
                            },
                            "depthwise_regularizer": null,
                            "depthwise_constraint": null
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "zero_padding2d_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "batch_normalization_4",
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_4",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "depthwise_conv2d_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "re_lu_4",
                        "class_name": "ReLU",
                        "config": {
                            "name": "re_lu_4",
                            "trainable": true,
                            "dtype": "float32",
                            "max_value": null,
                            "negative_slope": 0.0,
                            "threshold": 0.0
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_4",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "conv2d_3",
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_3",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 128,
                            "kernel_size": [
                                1,
                                1
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 1.0,
                                    "mode": "fan_avg",
                                    "distribution": "uniform",
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "re_lu_4",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "batch_normalization_5",
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_5",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_3",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "re_lu_5",
                        "class_name": "ReLU",
                        "config": {
                            "name": "re_lu_5",
                            "trainable": true,
                            "dtype": "float32",
                            "max_value": null,
                            "negative_slope": 0.0,
                            "threshold": 0.0
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_5",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "depthwise_conv2d_3",
                        "class_name": "DepthwiseConv2D",
                        "config": {
                            "name": "depthwise_conv2d_3",
                            "trainable": true,
                            "dtype": "float32",
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "activation": "linear",
                            "use_bias": true,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "depth_multiplier": 1,
                            "depthwise_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 1.0,
                                    "mode": "fan_avg",
                                    "distribution": "uniform",
                                    "seed": null
                                }
                            },
                            "depthwise_regularizer": null,
                            "depthwise_constraint": null
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "re_lu_5",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "batch_normalization_6",
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_6",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "depthwise_conv2d_3",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "re_lu_6",
                        "class_name": "ReLU",
                        "config": {
                            "name": "re_lu_6",
                            "trainable": true,
                            "dtype": "float32",
                            "max_value": null,
                            "negative_slope": 0.0,
                            "threshold": 0.0
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_6",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "conv2d_4",
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_4",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 128,
                            "kernel_size": [
                                1,
                                1
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 1.0,
                                    "mode": "fan_avg",
                                    "distribution": "uniform",
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "re_lu_6",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "batch_normalization_7",
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_7",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_4",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "re_lu_7",
                        "class_name": "ReLU",
                        "config": {
                            "name": "re_lu_7",
                            "trainable": true,
                            "dtype": "float32",
                            "max_value": null,
                            "negative_slope": 0.0,
                            "threshold": 0.0
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_7",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "zero_padding2d_3",
                        "class_name": "ZeroPadding2D",
                        "config": {
                            "name": "zero_padding2d_3",
                            "trainable": true,
                            "dtype": "float32",
                            "padding": [
                                [
                                    0,
                                    1
                                ],
                                [
                                    0,
                                    1
                                ]
                            ],
                            "data_format": "channels_last"
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "re_lu_7",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "depthwise_conv2d_4",
                        "class_name": "DepthwiseConv2D",
                        "config": {
                            "name": "depthwise_conv2d_4",
                            "trainable": true,
                            "dtype": "float32",
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "activation": "linear",
                            "use_bias": true,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "depth_multiplier": 1,
                            "depthwise_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 1.0,
                                    "mode": "fan_avg",
                                    "distribution": "uniform",
                                    "seed": null
                                }
                            },
                            "depthwise_regularizer": null,
                            "depthwise_constraint": null
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "zero_padding2d_3",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "batch_normalization_8",
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_8",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "depthwise_conv2d_4",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "re_lu_8",
                        "class_name": "ReLU",
                        "config": {
                            "name": "re_lu_8",
                            "trainable": true,
                            "dtype": "float32",
                            "max_value": null,
                            "negative_slope": 0.0,
                            "threshold": 0.0
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_8",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "conv2d_5",
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_5",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 256,
                            "kernel_size": [
                                1,
                                1
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 1.0,
                                    "mode": "fan_avg",
                                    "distribution": "uniform",
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "re_lu_8",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "batch_normalization_9",
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_9",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_5",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "re_lu_9",
                        "class_name": "ReLU",
                        "config": {
                            "name": "re_lu_9",
                            "trainable": true,
                            "dtype": "float32",
                            "max_value": null,
                            "negative_slope": 0.0,
                            "threshold": 0.0
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_9",
